docs/common_ontology.md
```mermaid
classDiagram 
   class Actor~core~{
   } 
   class Application~common~{
   } 
   class Asset~common~{
       contentType string
       description string
       id string
       name string
       version string
       implementsProtocol string
       publishedUnderContract string
       satisfiesRole anyURI
       isFederated boolean
       http://www.w3.org/ns/shacl#shapesGraph anyURI
       authenticationInformation string
       authenticationCode string
       authenticationKey string
       distributionMode string
   } 
   class BusinessPartner~common~{
   } 
   class DataspaceConnector~common~{
       url anyURI
   } 
   BusinessPartner --> DataspaceConnector : hasDataspaceConnector
   DataspaceConnector --> Asset : offers
   Asset --|> Application
   DataspaceConnector --|> Application
   BusinessPartner --|> Actor

```  
